# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y)

## -*- coding: utf-8 -*-

num = 0
while (num < 1 or num > 4):
    num = int(input('Введите номер четверти: '))

str = "A(x[1, ∞); y[1, ∞))" if num == 1 \
    else "A(x(-∞, -1]; y[1, ∞))" if num == 2 \
    else "A(x(-∞, -1]; y(-∞, -1])" if num == 3 \
    else "A(x[1, ∞); y(-∞, -1])"
print(str)